In [1]:
import pandas as pd

In [9]:
filas = 'ventas1 ventas2 ventas3'.split()
columnas = 'zonaA zonaB zonaC'.split()
datos = [[120,340,250],[210,450,250],[310,210,140]]
dataframe = pd.DataFrame(datos,filas,columnas)

In [10]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [11]:
nuevas_filas = 'dia1 dia2 dia3'.split()
nuevas_filas

['dia1', 'dia2', 'dia3']

In [12]:
dataframe['dias'] = nuevas_filas

In [14]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    340    250  dia1
ventas2    210    450    250  dia2
ventas3    310    210    140  dia3

In [16]:
dataframe.set_index('dias')

      zonaA  zonaB  zonaC
dias
dia1    120    340    250
dia2    210    450    250
dia3    310    210    140

In [17]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    340    250  dia1
ventas2    210    450    250  dia2
ventas3    310    210    140  dia3

In [18]:
dataframe = dataframe.set_index('dias')

In [19]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    120    340    250
dia2    210    450    250
dia3    310    210    140